src/DataProcessors/ЗагрузкаНормКанбановИПриборов/ЗагрузкаНормКанбановИПриборов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаНормКанбановИПриборов</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/НормыВремени/НормыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыВремени</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаПартию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ЗагрузкаНормКанбановИПриборов/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗагрузитьНормыВремени(СЗ)
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	МПЗ = Справочники.Номенклатура.НайтиПоНаименованию(СокрЛП(СЗ[0].Значение),Истина);
		Если Не МПЗ.Пустая() Тогда
			Для к = 1 По СЗ.Количество()-1 Цикл			
			ТехОперация = Справочники.ТехОперации.НайтиПоКоду(Формат(к,"ЧЦ=5; ЧВН=; ЧГ=0"),,ГруппаТехОпераций);
				Если Не ТехОперация.Пустая() Тогда
				НВ = Число(СЗ[к].Значение);	
				НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Объект.НаДату,Новый Структура("МПЗ,ТехОперация",МПЗ,ТехОперация));
					Если НормыВремени.НормаВремени <> НВ Тогда
					НормыВремени = РегистрыСведений.НормыВремени.СоздатьМенеджерЗаписи();
					НормыВремени.Период = Объект.НаДату;
				    НормыВремени.МПЗ = МПЗ;
					НормыВремени.ТехОперация = ТехОперация;
					НормыВремени.НормаВремени = НВ;
					НормыВремени.Записать(Истина);
					КонецЕсли;
				Иначе
				Сообщить("Тех. операция с кодом " + Формат(к,"ЧЦ=5; ЧВН=; ЧГ=0") + " - не найдена в выбранной группе справочника!");
				ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
				Возврат;
				КонецЕсли; 		
			КонецЦикла;  		
		Иначе	
		Сообщить(СЗ[0].Значение + " - не найден в справочнике номенклатуры!");
		КонецЕсли;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);	
	КонецПопытки;
КонецПроцедуры 

&НаКлиенте
Процедура Загрузить(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c нормами времени");
	Если Результат <> Неопределено Тогда
	СЗ = Новый СписокЗначений;

	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	КолКолонок = Результат.КоличествоКолонок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка норм времени из файла...");
		СЗ.Очистить();
			Для л = 1 По КолКолонок Цикл
			СЗ.Добавить(ExcelЛист.Cells(к,л).Value);		
			КонецЦикла;  
        ЗагрузитьНормыВремени(СЗ);
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура НаДатуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Объект.НаДату = НачалоМесяца(Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.НаДату = НачалоМесяца(ТекущаяДата());
КонецПроцедуры
